Revit 2024 API
ViewPrintedEventArgs Members
The ViewPrintedEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPostDocEventArgs.)
Index
 The index of the view being printed out of the set of all views being printed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
 (Inherited from RevitAPIPostEventArgs.)
TotalViews
 The number of all views being printed.
View
 The view that was printed.
See Also
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace